run/general/cylinderThermal/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

Tinlet  300;
Twall   400;

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }

    wall
    {
        type            fixedValue;
        value           uniform $Twall;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
